# 1회차 과제

#### 1. <파일 저장 형식> 'n회차_이름'으로 저장하여 보내주세요!!(꼭 지켜주세요) 
#### 2. 못 풀고 끄적인 흔적이라도 남겨주셔도 괜찮아요! 나중에 꼭 다시 풀어주세요!!
#### 3. 모든 결과를 출력해 주세요.

In [61]:
import pandas as pd
import numpy as np

Q1. 자신의 이름, 성별, 나이의 데이터가 있는 딕셔너리로 시리즈를 만드시오.

In [10]:
#code here

Q2. 위에서 만든 시리즈에서 성별과 나이를 2가지 방법으로 추출하시오.

In [ ]:
# code here

Q3. 아래와 같은 데이터프레임 'Member'를 만들어주세요.
    (단, 코드를 실행 후 나온 결과값이 저장되어야 합니다.)

In [41]:
# 이 칸은 shift+enter를 누르면 데이터프레임이 사라지므로 주의부탁드립니다.

  Name  Age Gender
0  김찬영   22      남
1  마민정   21      여
2  신기섭   21      남
3  유광열   21      남
4  이현준   21      남
5  한보혜   23      여

In [ ]:
# code here

Q4. 위에서 만든 데이터프레임의 'Name'열을 행의 인덱스로 변경하시오.

In [ ]:
# code here

Q5. 위의 데이터프레임에 'Role'이라는 열을 만들고 멤버별로 멘토 or 멘티라고 작성하시오.

In [ ]:
# code here

Q6. '곽홍재'라는 행을 만들고 나이, 성별, 역할 데이터를 추가하시오.(단, 역할은 전부학회장입니다.)

In [ ]:
# code here

Q7. 데이터프레임을 나이가 적은 순서대로 정렬하고 5번째부터 7번째 행을 2가지 방법을 사용하여 추출하시오.

In [ ]:
# code here

Q8. 다음 코드를 실행시키고 잘못된 곳을 찾아 2가지 방법으로 바르게 고치시오.

In [ ]:
Member['Belong'] = ['비대위','비대위','바스','경통','바스','경통','경영정보']

In [ ]:
# code here

Q9. 중간고사와 기말고사의 점수를 더하려던 도중 20점이었던 잉리 기말고사 점수가 누락되었다. 
    기말고사 잉리 점수가 20점이 채로 합산하도록 만드시오.
```python
middle = pd.Series({'경통':42,'회계':89,'글쓰기':17,'컴프2':86,'잉리':15})
final = pd.Series({'글쓰기':15,'컴프2':92,'경통':30,'회계':92})
```

In [ ]:
# code here

Q10.다음과 같은 데이터 프레임이 있을때 아래와 같이 나오도록 사칙연산을 이용하시요.
```python
df_1 = pd.DataFrame({
    'a':[65,49,495,16],
    'b':[69,156,15,625],
})

df_2 = pd.DataFrame({
    'a':[6,491,65,97],
    'b':[18,253,75,69],
})
```

In [42]:
# 이 칸은 shift+enter를 누르면 데이터프레임이 사라지므로 주의부탁드립니다.

     a     b
0  124   120
1 -393    59
2  925   -45
3  -65  1181

In [2]:
# code here

In [62]:
search= pd.read_csv('search.csv')
search.head()

   CLNT_ID  SESS_ID     KWD_NM  SEARCH_CNT
0  5607714  7112876   빌리프 아이크림           6
1  5607714  4090791  프리메라 마스크팩           3
2  5607714  4090791      여성청결제           1
3  5612428  1876482       명품가방           1
4  5612428   658123  콩순이 아이스크림           1

Q11.  CLNT_ID를 1번부터 마지막 숫자로 열을 바꾼후에 인덱스로 설정해주세요.

In [46]:
# code here

search.shape[0]
search.CLNT_ID = search.index
search.set_index('CLNT_ID',inplace=True)
search.head()

         SESS_ID     KWD_NM  SEARCH_CNT
CLNT_ID
0        7112876   빌리프 아이크림           6
1        4090791  프리메라 마스크팩           3
2        4090791      여성청결제           1
3        1876482       명품가방           1
4         658123  콩순이 아이스크림           1

Q12.SEARCH_CNT값이 가장 높은 값의 행의 KWD_NM를 추출하세요

In [65]:
# code here

search.sort_values(by='SEARCH_CNT',inplace=True)
search.iloc[0,2]

'헤라선메이트'

In [67]:
seoul_d= pd.read_csv('서울대기오염.csv')
seoul_d.head()

  측정소명  이산화질소농도   오존농도  일산화탄소농도          측정일시  아황산가스  미세먼지  초미세먼지
0  강남구    0.041  0.012      0.4  201903181200  0.008  34.0   20.0
1  강남구    0.038  0.015      0.4  201903181300  0.005  31.0   18.0
2  강남구    0.039  0.015      0.4  201903181400  0.006  30.0   18.0
3  강남구    0.033  0.020      0.3  201903181500  0.007  30.0   16.0
4  강남구    0.039  0.023      0.5  201903181600  0.010  42.0   27.0

Q13. 미세먼지와 초미세먼지의 합계를 나타내는 총미세먼지량 열을 추가하세요.

In [71]:
# code here

m=seoul_d.미세먼지
n=seoul_d.초미세먼지

seoul_d['총미세먼지량'] = m+n
seoul_d.head()

  측정소명  이산화질소농도   오존농도  일산화탄소농도          측정일시  아황산가스  미세먼지  초미세먼지  총미세먼지량
0  강남구    0.041  0.012      0.4  201903181200  0.008  34.0   20.0    54.0
1  강남구    0.038  0.015      0.4  201903181300  0.005  31.0   18.0    49.0
2  강남구    0.039  0.015      0.4  201903181400  0.006  30.0   18.0    48.0
3  강남구    0.033  0.020      0.3  201903181500  0.007  30.0   16.0    46.0
4  강남구    0.039  0.023      0.5  201903181600  0.010  42.0   27.0    69.0

Q14.  측정소명을 출력하여 각 구의 랜드마크와 함께 딕셔너리를 만드세요,
(ex:{'성북구':'국민대'},hint 측정소명을 리스트로 만들어 구글링 해보세요. )

In [98]:
# code here

s=list(set(seoul_d.측정소명))
d = {}
for i in s:
    d[i] = i+' 구청'
d

{'동대문구': '동대문구 구청',
 '서대문구': '서대문구 구청',
 '양천구': '양천구 구청',
 '종로구': '종로구 구청',
 '서초구': '서초구 구청',
 '도봉구': '도봉구 구청',
 '송파구': '송파구 구청',
 '마포구': '마포구 구청',
 '강동구': '강동구 구청',
 '관악구': '관악구 구청',
 '동작구': '동작구 구청',
 '성북구': '성북구 구청',
 '성동구': '성동구 구청',
 '강북구': '강북구 구청',
 '용산구': '용산구 구청',
 '노원구': '노원구 구청',
 '중구': '중구 구청',
 '강남구': '강남구 구청',
 '영등포구': '영등포구 구청',
 '은평구': '은평구 구청',
 '중랑구': '중랑구 구청',
 '금천구': '금천구 구청',
 '구로구': '구로구 구청',
 '강서구': '강서구 구청',
 '광진구': '광진구 구청'}

Q15. 4번에서 만든 딕셔너리로 시리즈와 데이터 프레임을 각각 만든후에 성북구,중랑구,동대문구를 출력하세요.

In [107]:
# code here

ad=pd.Series(d)
ad[['동대문구','성북구','중랑구']]

동대문구    동대문구 구청
성북구      성북구 구청
중랑구      중랑구 구청
dtype: object

In [117]:
add=pd.DataFrame(d,index=[0])
add[['동대문구','성북구','중랑구']]

      동대문구     성북구     중랑구
0  동대문구 구청  성북구 구청  중랑구 구청

In [7]:
seoul = pd.read_csv('df.csv')
seoul.head()

,구별,소계,2013년도 이전,2014년,2015년,2016년,인구수,한국인,외국인,고령자
0,강남구,2780,1292,430,584,932,570500.0,565550.0,4950.0,63167.0
1,강동구,773,379,99,155,377,453233.0,449019.0,4214.0,54622.0
2,강북구,748,369,120,138,204,330192.0,326686.0,3506.0,54813.0
3,강서구,884,388,258,184,81,603772.0,597248.0,6524.0,72548.0
4,관악구,1496,846,260,390,613,525515.0,507203.0,18312.0,68082.0

Q16. 구별로 최근 3년간 CCTV 증가율을 구하여 열을 추가해주세요.

In [6]:
# code here

Q17. 구별로 인구수 대비 CCTV 개수의 비율을 구하여 열을 추가해주세요.

In [6]:
# code here

Q18. 성북구의 외국인 비율을 구해주세요.

In [6]:
# code here

Q19. 열 '구별'을 인덱스로 지정해 용산구, 은평구, 종로구, 중구, 중랑구의 인구 수를 출력해주세요. (loc, iloc 모두 해보세요.)

In [6]:
# code here

Q20. 이 데이터를 봤을 때 지금 당장 CCTV 설치가 가장 필요한 곳은 어디라고 생각하나요? (이 문제는 정답이 따로 없습니다. 이 데이터를 분석해서 본인이 생각했을 때 가장 필요하다는 곳을 말해주세요. 단, 본인의 주장에 합당한 이유가 코드로 드러나야 합니다.)

In [6]:
# code here